c5/src/AccumulationRegisters/Discounts/Discounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Discounts</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.Invoice</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.Return</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

c5/src/AccumulationRegisters/VendorDiscounts/VendorDiscounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>VendorDiscounts</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.ExpenseReport</types>
      <types>DocumentRef.VendorInvoice</types>
      <types>DocumentRef.PurchaseOrder</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

c5/src/Documents/SalesOrder/SalesOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SalesOrder</name>
  <basedOn>Document.Quote</basedOn>
  <basedOn>Document.IOSheet</basedOn>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.Allocation</registerRecords>
  <registerRecords>AccumulationRegister.SalesOrderDebts</registerRecords>
  <registerRecords>AccumulationRegister.SalesOrders</registerRecords>
  <registerRecords>AccumulationRegister.Provision</registerRecords>
  <registerRecords>AccumulationRegister.Items</registerRecords>
  <registerRecords>AccumulationRegister.Debts</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceDebts</registerRecords>
  <registerRecords>AccumulationRegister.Reserves</registerRecords>
  <attributes>
    <name>Action</name>
    <type>
      <types>EnumRef.Actions</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Guarantee</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IOSheet</name>
    <type>
      <types>DocumentRef.IOSheet</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Performer</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>PO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>Process</name>
    <type>
      <types>BusinessProcessRef.SalesOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>Quote</name>
    <type>
      <types>DocumentRef.Quote</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Resolution</name>
    <type>
      <types>EnumRef.Resolutions</types>
    </type>
  </attributes>
  <attributes>
    <name>Tax</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Taxable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxableAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>CatalogRef.TaxCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxGroup</name>
    <type>
      <types>CatalogRef.TaxGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRate</name>
    <type>
      <types>DefinedType.TaxRate</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Changes</name>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Information</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Reason</name>
      <type>
        <types>EnumRef.ChangeReasons</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrder</name>
      <type>
        <types>DocumentRef.ProductionOrder</types>
        <types>DocumentRef.PurchaseOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrderRowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Reservation</name>
      <type>
        <types>EnumRef.Reservation</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Stock</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxableAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxCode</name>
      <type>
        <types>CatalogRef.TaxCodes</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Payments</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Option</name>
      <type>
        <types>CatalogRef.PaymentOptions</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Department</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Performer</name>
      <type>
        <types>EnumRef.Performers</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxableAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxCode</name>
      <type>
        <types>CatalogRef.TaxCodes</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Taxes</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
    <attributes>
      <name>Tax</name>
      <type>
        <types>CatalogRef.TaxItems</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/CommonModules/DiscountsTable/Module.bsl
&AtServer
Procedure Load ( Object ) export
		
	sale = TypeOf ( Object.Ref ) = Type ( "DocumentRef.Invoice" );
	data = getDiscounts ( Object, sale );
	table = discountsVAT ( data );
	order = ? ( sale, "SalesOrder", "PurchaseOrder" );
	discounts = Object.Discounts; 
	discounts.Clear ();
	item = Application.Discounts ();
	accounts = AccountsMap.Item ( item, Object.Company, Object.Warehouse, "Income, VAT" );
	useVAT = Object.VATUse > 0;
	for each row in table do
		newRow = discounts.Add ();
		newRow [ order ] = row.Document; 
		newRow.Item = item; 
		newRow.VATCode = row.VATCode;
		rate = row.VATRate;
		newRow.VATRate = rate; 
		newRow.Amount = row.Amount;
		if ( useVAT ) then
			calcRowVAT ( newRow );
		endif;
		newRow.Income = accounts.Income; 
		newRow.VATAccount = accounts.VAT; 
	enddo;
	
EndProcedure

Procedure calcRowVAT ( Row )
	
	amount = Row.Amount;
	Row.VAT = amount - Round ( ( amount * 100 ) / ( 100 + Row.VATRate ), 2 );
	
EndProcedure

&AtServer
Function getDiscounts ( Object, Sale )
	
	if ( Sale ) then
		register = "AccumulationRegister.Discounts";
		document = "Document.SalesOrder";
	else
		register = "AccumulationRegister.VendorDiscounts";
		document = "Document.PurchaseOrder";
	endif; 
	s = "
	|// #Orders
	|select Orders.Ref as Document, Orders.VATCode as VATCode, Orders.VATCode.Rate as VATRate,
	|	sum ( Orders.Total ) as Amount
	|from (
	|	select Items.Ref as Ref, Items.VATCode as VATCode, Items.Total as Total
	|	from " + document + ".Items as Items
	|	where Items.Ref in ( &Orders )
	|	union all
	|	select Services.Ref, Services.VATCode, Services.Total
	|	from " + document + ".Services as Services
	|	where Services.Ref in ( &Orders )
	|) as Orders
	|group by Orders.Ref, Orders.VATCode
	|;
	|// #Discounts
	|select Discounts.Document as Document, sum ( Discounts.Amount ) as Amount
	|from (
	|	select Discounts.Document as Document, Discounts.Amount as Amount
	|	from " + register + " as Discounts
	|	where Discounts.Document in ( &Orders )
	|	and Discounts.Period < &Date
	|	union all
	|	select Discounts.Detail, - Discounts.Amount
	|	from " + register + " as Discounts
	|	where Discounts.Detail in ( &Orders )
	|	and Discounts.Period < &Date
	|	) as Discounts
	|group by Discounts.Document
	|having sum ( Discounts.Amount ) > 0
	|order by Discounts.Document.Date
	|";
	data = SQL.Create ( s );
	q = data.Q;
	q.SetParameter ( "Ref", Object.Ref );
	q.SetParameter ( "Contract", Object.Contract );
	q.SetParameter ( "Date", Periods.GetDocumentDate ( Object ) );
	q.SetParameter ( "Orders", InvoiceForm.GetOrders ( Object, not Sale ) );
	SQL.Perform ( data, false );
	return data;
	
EndFunction 

&AtServer
Function discountsVAT ( Data )
	
	p = new Structure ();
	p.Insert ( "FilterColumns", "Document" );
	p.Insert ( "DistribColumnsTable1", "Amount" );
	p.Insert ( "KeyColumn", "Amount" );
	p.Insert ( "AssignСоlumnsTаble1", "Document" );
	p.Insert ( "AssignСоlumnsTаble2", "VATCode, VATRate" );
	discounts = data.Discounts;
	amountType = Metadata.Documents.Invoice.TabularSections.Discounts.Attributes.Amount.Type;
	CollectionsSrv.Adjust ( discounts, "Amount", amountType );
	table = CollectionsSrv.Combine ( discounts, data.Orders, p );
	return table;
	
EndFunction

&AtClient
Procedure ApplyItem ( Form ) export
	
	object = Form.Object;
	row = Form.Items.Discounts.CurrentData;
	data = DiscountsTableSrv.GetData ( row.Item, object.Company, object.Warehouse );
	row.Income = data.IncomeAccount;
	row.VATAccount = data.VATAccount;
	row.VATCode = data.VAT;
	row.VATRate = data.Rate;
	DiscountsTable.CalcVAT ( Form );
	
EndProcedure

&AtClient
Procedure CalcVAT ( Form ) export
	
	row = Form.Items.Discounts.CurrentData;
	if ( Form.Object.VATUse = 0 ) then
		row.VAT = 0;
	else
		calcRowVAT ( row );
	endif;
	
EndProcedure

&AtClient
Procedure SetRate ( Form ) export
	
	row = Form.Items.Discounts.CurrentData;
	row.VATRate = DF.Pick ( row.VATCode, "Rate" );
	
EndProcedure

&AtServer
Procedure RecalcVAT ( Form ) export
	
	object = Form.Object;
	useVAT = object.VATuse > 0;
	for each row in object.Discounts do
		if ( useVAT ) then
			calcRowVAT ( row );
		else
			row.VAT = 0;
		endif;
	enddo; 
	
EndProcedure
